import { createContext } from "react";

export const DiffBio5 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "11",
      subject: "bio",
      level: "3",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "ข้อใดกล่าวถูกต้องเกี่ยวกับการศึกษาพันธุศาสตร์ของเมนเดล?",
          choice: [
            { 1: "ลักษณะของถั่วลันเตาที่เมนเดลเลือกมาศึกษามีทั้งหมด 9 ลักษณะ" },
            {
              2: "ลักษณะของถั่วลันเตาที่เมนเดลศึกษามีแอลลีนควบคุมเพียง 1 เเอลลีนเท่านั้น",
            },
            {
              3: "ลักษระฟีโนไทป์ของรุ่น F2 จะมีอัตราส่วนลักษณะเด่น:ลักษณะด้อย เท่ากับ 1:1",
            },
            {
              4: "การถ่ายทอดลักษณะของรุ่น F1 พบว่า ลักษณะเด่นจะข่มลักษณะด้อยอย่างสมบูรณ์",
            },
          ],
          answer: "4",
        },
        {
          question:
            "ในการผสมถั่ว 2 ชนิด คือ ถั่วพันธุ์สูงกับถั่วพันธุ์เตี้ย ซึ่งเป็น recessive ปรากฎว่าได้รุ่นลูก F1 เป็นสูง:เตี้ย = 1:1 genotype ของถั่วรุ่นพ่อเเม่คือข้อใด?",
          choice: [
            { 1: "Tt x TT" },
            { 2: "TT x tt" },
            { 3: "Tt x tt" },
            { 4: "Tt x Tt" },
          ],
          answer: "3",
        },
        {
          question: "ข้อใดเป็น homozygous ทั้งหมด?",
          choice: [{ 1: "TTYy" }, { 2: "TTRR" }, { 3: "ttYy" }, { 4: "ttRr" }],
          Answer: "2",
        },
        {
          question:
            "ในการผสมพันธุ์ระหว่าง Aa Bb cc X Aa Bb cc ให้ลูกผสมจีโนไทป์ทั้งหมดกี่แบบ?",
          choice: [{ 1: "4" }, { 2: "6" }, { 3: "9" }, { 4: "16" }],
          Answer: "3",
        },
        {
          question: "ลักษณะในข้อใดไม่ถูกถ่ายทอดทางพันธุกรรม?",
          choice: [
            { 1: "ติ่งหู" },
            { 2: "ลักยิ้ม" },
            { 3: "ความสูง" },
            { 4: "รอยแผลเป็น" },
          ],
          Answer: "4",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
