import { createContext } from "react";

export const EasyBio5 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "11",
      subject: "bio",
      level: "1",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "แอลลีน หมายถึงข้อใด?",
          choice: [
            { 1: "ยีนต่างชนิดกันอยู่บนตำเเหน่งเดียวกันของฮอมอโลกัสโครโมโซม" },
            {
              2: "ยีนเหมือนกันควบคุมพันธุกรรมเดียวกัน",
            },
            {
              3: "ยีนที่เป็นฮอมอไซกัสบนตำเเหน่งเดียวกันของฮอมอไซกัสโครโมโซม",
            },
            {
              4: "หน่วยพันธุที่เป็นคู่กันบนฮอมอโลกัสโครโมโซม",
            },
          ],
          answer: "1",
        },
        {
          question:
            "ถ้ากำหนดให้ (P) เป็นลักษณะเด่นในการผสมพันธุ์ถั่วลันเตา ปรากฎว่า ลูกที่ได้รุ่นเเรกมีดอกสีขาวเเละดอกสีม่วงอย่างละเท่าๆกัน จงหาจีโนไทป์ของต้นพ่อแเละต้นเเม่ควรเป็นอย่างไร?",
          choice: [
            { 1: "Pp x pp" },
            { 2: "Pp x Pp" },
            { 3: "Pp x PP" },
            { 4: "PP x pp" },
          ],
          answer: "1",
        },
        {
          question:
            "ตามกฎการรวมกลุ่มอย่างอิสระของเมนเดล สิ่งมีชีวิตตที่มีจีโนไทป์เป็น AaBbCc จะมีเซลล์สืบพันธุ์ได้กี่แบบ?",
          choice: [
            { 1: "2 แบบ" },
            { 2: "4 แบบ" },
            { 3: " 6 แบบ" },
            { 4: "8 แบบ" },
          ],
          Answer: "4",
        },
        {
          question: "เพราะเหตุใด เมนเดล จึงเลือกที่จะทำการทดลองกับถั่วลันเตา?",
          choice: [
            { 1: "มีอายุสั้น ปลูกง่าย" },
            { 2: "มีหลายพันธุกรรมที่มีลักษณะเเตกต่างกันอย่างชัดเจน" },
            { 3: "มีการถ่ายทอดละอองเรณูในดอกเดียวกัน" },
            { 4: "ถูกทุกข้อ" },
          ],
          Answer: "4",
        },
        {
          question:
            "ถ้า T เเทนแอลลีนที่มีลักษณะเด่น t แทน แอลลีนที่มีลักษณะด้อย พ่อเเม่ที่มีจีโนไทป์ Tt และ tt เเละลูกที่เกิดมาจะมีโอกาสเเสดงลักษณะตามข้อใด?",
          choice: [
            { 1: "เด่นทั้งหมด" },
            { 2: "ด้อยทั้งหมด" },
            { 3: "ด้อย 50%" },
            { 4: "เด่น 25% ด้อย 75%" },
          ],
          Answer: "3",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
