import { createContext } from "react";

export const NormalBio5 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "11",
      subject: "bio",
      level: "2",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "ลักษณะต่อไปนี้ Aa x aa จะมีจีโนไทป์กี่แบบฟีโนไทป์กี่แบบ?",
          choice: [
            { 1: "จีโนไทป์ 1 ฟีโนไทป์ 1" },
            {
              2: "จีโนไทป์ 2 ฟีโนไทป์ 2",
            },
            {
              3: "จีโนไทป์ 3 ฟีโนไทป์ 3",
            },
            {
              4: "จีโนไทป์ 1 ฟีโนไทป์ 1",
            },
          ],
          answer: "2",
        },
        {
          question:
            "ถ้าผสมถั่วลั้นเตาต้นสูงพันธุ์เเท้กับถั่วลันเตาต้นเตี้ยพันธุ์เเท้ จะได้อัตราส่วนของจีโนไทป์ในลูกรุ่น F2 เท่ากับเท่าใด?",
          choice: [{ 1: "1:2:1" }, { 2: "1:1" }, { 3: "3:1" }, { 4: "1:0" }],
          answer: "1",
        },
        {
          question:
            "ผสมถั่วลันเตาฝักสีเขียว (YY) กับฝักสีเหลือง (yy) ลูกที่ได้ในรุ่นที่ F1 จะมีลักษณะอย่างไร?",
          choice: [
            { 1: "ได้ฝักสีเขียว : ผักสีเหลือง = 1" },
            { 2: "ได้ฝักสีเขียว : ผักสีเหลือง = 2" },
            { 3: " ได้ถั่วฝักสีเขียวทั้งหมด" },
            { 4: "ได้ถั่วฝีกสีเหลืองทั้งหมด" },
          ],
          Answer: "4",
        },
        {
          question: "ข้อใดกล่าวไม่ถูกต้อง?",
          choice: [
            { 1: "Tt จะเเสดงลักษณะเด่น" },
            { 2: "TT จะเเสดงลักษณะเด่น" },
            { 3: "tt จะเเสดงลักษณะด้อย" },
            { 4: "tt จะเเสดงลักษณะเด่น" },
          ],
          Answer: "4",
        },
        {
          question: "ข้อใดกล่าวไม่ถูกต้องเกี่ยวกับกฎของเมนเดล?",
          choice: [
            { 1: "กฎข้อที่ 1 คือกฎการรวมกลุ่มอย่างอิสระ" },
            { 2: "กฎข้อที่ี 2 คือกฎเเห่งการเเยก" },
            { 3: "Law of segeration คือกฎเเห่งการเเยก" },
            {
              4: "Law of independent assortment คือกฎเเห่งการรวมกลุ่มอย่างอิสระ",
            },
          ],
          Answer: "1",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
