import { createContext } from "react";

export const EasyChem5 = [
  [
    {
      label: "test1",
      grade: "11",
      subject: "chem",
      level: "1",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "ข้อใดบอกสมบัติของสารละลายเบสผิด?",
          choice: [
            { 1: "มีรสฝาด" },
            { 2: "นำไฟฟ้าได้" },
            { 3: "ผสมกับไขมันได้สบู่" },
            { 4: "กระดาษลิตมัสจากสีน้ำเงินเป็นสีเเดง" },
          ],
          answer: "4",
        },
        {
          question: "ข้อใดไม่ถูกต้อง?",
          choice: [
            {
              1: "จุดยุติ คือจุดที่กรดกับเบสทำปฏิกิริยาพอดีกันโดยสังเกตจากการเปลี่ยนสีของอินดิเคเตอร์",
            },
            {
              2: "จุดสมดุล คือจุดที่กรดกับเบสทำปฏิกิริยาพอดีกันตามสมการที่สมดุลเเล้วโดยกรด-เบสหมด เหลือเกลือกับน้ำ",
            },
            { 3: "ไม่มีข้อไหนผิด" },
            {
              4: "จุดสะเทิน ขึ้นอยู่กับชนิดของกรดเเละเบสที่นำมาไทเทรดกัน เเละขึ้นอยู่กับความเข้มข้นของกรดเเละเบส",
            },
          ],
          answer: "3",
        },
        {
          question: "ข้อใดผิดเรื่องสารละลายกรดเเละสารละลายเบส?",
          choice: [
            { 1: "นำไฟฟ้าได้" },
            { 2: "เปลี่ยนสีกระดาษลิตมัส" },
            { 3: "ทำปฏิกิริยากับโลหะเเละเกลือ" },
            { 4: "กรดเเละเบสไม่สามารถเเตกตัวเป็นไอออน" },
          ],
          Answer: "4",
        },
        {
          question: "ข้อใดไม่ใช้สารละลายกรดเเละเบสในชีวิตประจำวัน?",
          choice: [
            { 1: "น้ำส้มสายชู" },
            { 2: "น้ำส้ม" },
            {
              3: "น้ำมะนาว",
            },
            {
              4: "น้ำเกลือ",
            },
          ],
          Answer: "4",
        },
        {
          question:
            "สารอิเล็กโทรไลต์จะแตกตัวเป็นไอออน เมื่อละลายอยู่ในน้ำข้อใดเป็นกรดที่เมื่อละลายน้ำแล้วแตกตัวให้ไฮโดรเจนไอออน",
          choice: [
            { 1: "HCl(g) →  H+(aq) + Cl-(aq)" },
            { 2: "NaOH(s) →  Na+(aq) + OH-(aq)" },
            { 3: "Ca(OH)2(s) → Ca2+(aq) + 2OH-(aq)" },
            { 4: "KOH (s) → K+(aq) + OH-(aq)" },
          ],
          Answer: "1",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
