import { createContext } from "react";

export const DiffChem5 = [
  [
    {
      label: "test1",
      grade: "11",
      subject: "chem",
      level: "3",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "ข้อใดต่อไปนี้ถูกต้อง?",
          choice: [
            { 1: "สมดุลทุกชนิดเป็นสมดุลไานามิก" },
            { 2: "สมดุลเคมีทุกชนิดเป็นสมดุลไดนามิก" },
            { 3: "สมดุลไานามิก คือสมดุลที่มีสารทั้งสองข้างเท่ากันตลอดเวลา" },
            { 4: "ถูกทุกข้อ" },
          ],
          answer: "2",
        },
        {
          question: "ข้อความใดไม่จำเป็นสำหรับระบบที่อยู่ภาวะสมดุล?",
          choice: [
            { 1: "เป็นระบบเปิด" },
            { 2: "มีความเข้มข้นคงที่" },
            { 3: "มีความเข้มข้นของสารผลิตภัณฑ์เท่าสารตั้งต้น" },
            {
              4: "มีอัตราเร็วของปฏิกิริยาไปข้างหน้าเเละปฏิกิริยาย้อนกลับเท่ากัน",
            },
          ],
          answer: "3",
        },
        {
          question: "ค่าความสมดุลขึ้นอยู่กับ?",
          choice: [
            { 1: "ความดัน" },
            { 2: "ปริมาตร" },
            { 3: "อุณหภูมิ" },
            { 4: "ถูกทุกข้อ" },
          ],
          Answer: "4",
        },
        {
          question:
            "เมื่อมีการเปลี่ยนแปลงความเข้มข้นของสารตั้งต้นหรือผลิตภัณฑ์ของระบบที่อยู่ในภาวะสมดุลโดยควบคุมให้อุณหภูมิคงที่ เมื่อระบบเข้าสู่สมดุลใหม่ ค่าคงที่ของสมดุลจะมีการเปลี่ยนแปลงอย่างไร?",
          choice: [
            { 1: "เมื่อเพิ่มความเข้มข้นของสารตั้งต้น ค่าคงที่ของสมดุลจะเพิ่ม" },
            { 2: "เมื่อลดความเข้นข้มของสารตั้งต้น ค่าคงที่ของสมดุลจะลดลง" },
            {
              3: "เมื่อเพิ่มความเข้มข้นของผลิตภัณฑ์ ค่าคงที่ของสมดุลจะเพิ่มขึ้น",
            },
            {
              4: "ไม่ว่าจะเพิ่มหรือลดความเข้มข้นของสารตั้งต้นหรือสารผลิตภัณฑ์ ค่าคงที่ของสมดุลจะไม่เปลี่ยนแปลง",
            },
          ],
          Answer: "4",
        },
        {
          question: "กรณีใดที่ทำให้ปฏิกิริยาเคมีเข้า่สู่ภาวะสมดุลได้เร็วที่สุด",
          choice: [
            { 1: "เพิ่มอุณหภูมิ" },
            { 2: "ค่าคงที่ของสมดุลมีค่ามาก" },
            { 3: "ค่าคงที่ของสมดุลมีค่าน้อย" },
            { 4: "ค่าคงที่ของสมดุลมีค่าประมาณเท่ากับ 1" },
          ],
          Answer: "1",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
