import { createContext } from "react";

export const EasyMath5 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "11",
      subject: "math",
      level: "1",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question:
            "พยัญชนะ 6 ตัวต่างกัน สระ 5 ตัวต่าง ถ้านำมาจัดเป็นคำให้เเต่ละคำมีตัวอักษร 5 ตัว เป็นพยัญชนะ 3 ตัว สระ 2 ตัว เเล้วจะมีกี่วิธีจัดได้ทั้งหมดกี่คำ?",
          choice: [
            { 1: "2,000" },
            { 2: "24,000" },
            { 3: "12,000" },
            { 4: "36,000" },
          ],
          answer: "4",
        },
        {
          question:
            "มีตัวอักษรชุดหนึ่งคือ aaabbccddef ถ้าต้องการนำตัวอักษรเพียง 4 ตัว มาจัดเป็นคำจะได้กี่วิธี",
          choice: [{ 1: "56" }, { 2: "360" }, { 3: "240" }, { 4: "656" }],
          answer: "2",
        },
        {
          question:
            "เเจกไพ่ 5 ใบจากสำรับให้ได้ ace 3 ใบ เเละอีก 2 ใบไม่เป็น ace ดังนั้นจะมีกี่วิธีที่ไพ่จะขึ้นมือ?",
          choice: [
            { 1: "4,512" },
            { 2: "3,846" },
            { 3: "4,412" },
            { 4: "3,686" },
          ],
          Answer: "1",
        },
        {
          question: "ข้อความใดต่อไปนี้ ไม่ถูกต้อง?",
          choice: [
            { 1: "เลข 4 หลัก ซึ่งมากกว่า 8,000 มี 1,999 จำนวน" },
            { 2: "เลข 4 หลัก ซึ่งมากกว่า 8,000 เเละเป็นเลขคี่มี 1,000 จำนวน" },
            { 3: "เลข 4 หลัก ซึ่งมากกว่า 4,000 เเละเป็นเลขคู่มี 1,500 จำนวน" },
            { 4: "เลข 4 หลัก ซึ่งมากกว่า 4,000 เเละเป็นเลขคี่มี 2,500 จำนวน" },
          ],
          Answer: "4",
        },
        {
          question:
            "กำหนดจุด 5 จุด มี 3 จุดอู่บนเส้นตรงเดียวกัน ดังนั้นจะลาเส้นตรงเชื่อมระหว่างจุด 2 จุด ได้ทั้งหมดกี่เส้น",
          choice: [{ 1: "7" }, { 2: "10" }, { 3: "8" }, { 4: "12" }],
          Answer: "3",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
