import { createContext } from "react";

export const NormalMath5 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "11",
      subject: "math",
      level: "2",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question:
            "ค่าเฉลี่ยเลขคณิตของคะเเนนสอบวิชาคณิตศาสตร์ของนักเรียนห้องหนึ่งเป็น 43 คะเเนน ถ้าคิดค่าเฉลี่ยเลขคณิตของคะเเนนสอบของนักเรียนชายเเละหญิงเเยกกันจะได้ 40 เเละ 45 คะเเนนตามลำดับ เเล้วอัตราส่วนระหว่างจำนวนนักเรียนชายกับจำนวนนักเรียนหญิงคือเท่าใด?",
          choice: [{ 1: "2:3" }, { 2: "3:2" }, { 3: "5:2" }, { 4: "5:3" }],
          answer: "1",
        },
        {
          question:
            "ข้อมูลชุดหนึ่งเป็ยจำนวนเต็ม 5 จำนวน พบว่ามีค่าเฉี่ยเลขคณิต มัธยฐาน เเละพิสัย เป็น 2,550 เท่ากัน ข้อมูลชุดนี้มีได้ทั้งหมดกี่เเบบ",
          choice: [
            { 1: "849 เเบบ" },
            { 2: "850 แบบ" },
            { 3: "851 แบบ" },
            { 4: "852 แบบ" },
          ],
          answer: "1",
        },
        {
          question:
            "ข้อมูลชุดหนึ่งมีค่าความแปรปรวนเป็น 17 ถ้าสร้างข้อมูลใหม่โดยให้มีค่ามากกว่า 2 เท่าของข้อมูลชุดเดิมอยู่ 3 ทุกจำนวน จะได้ข้อมูลใหม่มีความแปรปรวนเป็นเท่าไร?",
          choice: [{ 1: "17" }, { 2: "34" }, { 3: "51" }, { 4: "68" }],
          Answer: "4",
        },
        {
          question:
            "ส่วนเบี่ยงเบนมาตรฐานของข้อมูล 2549, 2552, 2553, 2555 เท่ากับข้อใด?",
          choice: [{ 1: "2" }, { 2: "2.3" }, { 3: "2.5" }, { 4: "3" }],
          Answer: "1",
        },
        {
          question:
            "ส่วนเบี่ยงเบนมาตรฐานของข้อมูล 3, 7, 11, 15, 19, 23, 27 เป็นเท่าไร?",
          choice: [{ 1: "6" }, { 2: "7" }, { 3: "8" }, { 4: "19" }],
          Answer: "3",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
