import { createContext } from "react";

export const DiffMath5 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "11",
      subject: "math",
      level: "3",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "จงหาผลบวกของอนุกรม 1+3+5+...+99",
          choice: [
            { 1: "1,250" },
            { 2: "2,400" },
            { 3: "2,500" },
            { 4: "2,600" },
          ],
          answer: "3",
        },
        {
          question:
            "ถ้า x เเละ y เป็นจำนวนจริงบวกเเละ x+y = 10 เเล้วจงหาค่ามากที่สุดของ xy",
          choice: [{ 1: "20" }, { 2: "24" }, { 3: "25" }, { 4: "30" }],
          answer: "3",
        },
        {
          question:
            "ในลำดับเลขคณิตศาสตร์พจน์ที่ 4 เป็น 28 เเละพจน์ที่ 8 เป็น 48 ดังนั้นพจน์ที่หนึ่งมีค่าเท่าใด?",
          choice: [{ 1: "8" }, { 2: "13" }, { 3: "18" }, { 4: "23" }],
          Answer: "3",
        },
        {
          question:
            "ในการสอบวิชาภาษาไทย นักเรียนคนหนึ่งสอบครั้งเเรกได้ 42 คะเเนน ครั้งต่อๆ ไปได้เพิ่มขึ้น 8 คะเเนน ถ้านักเรียนคนนี้สอบไปอีก 6 ครั้ง เเล้วคะเเนนเฉลี่ยของนักเรียนคนนี้เป็นกี่คะเเนน?",
          choice: [{ 1: "66" }, { 2: "68" }, { 3: "70" }, { 4: "74" }],
          Answer: "1",
        },
        {
          question: "มีกี่จำนวนที่อยู่ระหว่าง 500 ถึง 800 เเละ 9 หารลงตัว ",
          choice: [{ 1: "0.2" }, { 2: "0.6" }, { 3: "1.0" }, { 4: "0.5" }],
          Answer: "1",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
