import { createContext } from "react";

export const DiffPhy5 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "11",
      subject: "phy",
      level: "3",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "อนุภาคใดเป็นตัวการทำให้เกิดสนามไฟฟ้า?",
          choice: [
            { 1: "อิเล็กตรอน โปรตอน" },
            { 2: "โปรตอน นิวตรอน" },
            { 3: "อิเล็กตรอน นิวตรอน" },
            { 4: "อิเล็กตรอน โปรตอน และนิวตรอน" },
          ],
          answer: "1",
        },
        {
          question:
            "แท่งแก้วที่เป็นกลางทางไฟฟ้า ถ้าถูกผ้าขัดจนมีประจุไฟฟ้าบวก เนื่องจากสาเหตุใด?",
          choice: [
            { 1: "แท่งแก้วสร้างโปรตอน" },
            { 2: "อิเล็กตรอนในผ้าหลุดออก" },
            { 3: "แท่งแก้วเสียอิเล็กตรอน" },
            {
              4: "แท่งแก้วเสียนิวตรอน",
            },
          ],
          answer: "3",
        },
        {
          question: "ประจุคู่ใดบ้างที่มีแรงชนิดเดียวกัน?",
          choice: [
            { 1: "โปรตอน นิวตรอน, นิวตรอน นิวตรอน" },
            { 2: "โปรตอน อิเล็กตรอน, อิเล็กตรอน อิเล็กตรอน" },
            { 3: "โปรตอน โปรตอน, อิเล็กตรอน อิเล็กตรอน " },
            { 4: "โปรตอน อิเล็กตรอน, อิเล็กตรอน นิวตรอน" },
          ],
          Answer: "3",
        },
        {
          question:
            "นำวัตถุที่มีประจุไฟฟ้าบวกไปแตะที่ผิวด้านในของตัวนำวงแหวน ผิวด้านนอกของตัวนำวงแหวน มีประจุไฟฟ้าชนิดใด?",
          choice: [
            { 1: "บวก" },
            { 2: "กลาง" },
            {
              3: "ลบ",
            },
            {
              4: "ศูนย์",
            },
          ],
          Answer: "1",
        },
        {
          question:
            "เมื่อนำแท่งแก้วที่มีประจุไฟฟ้าบวกไปแตะกับตัวนำทรงกลมที่เป็นกลางทางไฟฟ้า เหตุใดตัวนำ ทรงกลมจึงมีประจุไฟฟ้าเป็นบวก",
          choice: [
            { 1: "บวกจะถ่ายเทไปหาลบเสมอ" },
            { 2: "ทรงกลมเสียประจุลบ" },
            { 3: "ทรงกลมได้รับประจุบวก" },
            { 4: "ลบจะถ่ายเทไปที่วัตถุที่เป็นลบเหมือนกัน" },
          ],
          Answer: "3",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
