import { createContext } from "react";

export const NormalPhy5 = [
  [
    {
      label: "test1",
      grade: "11",
      subject: "phy",
      level: "2",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question:
            "ตัวนำทรงกลมมีประจุไฟฟ้าบนผิวนอก ตำแหน่งใดสนามไฟฟ้ามีค่าเป็นศูนย์?",
          choice: [
            { 1: "ด้านบนตัวนำ" },
            { 2: "ที่ผิวตัวนำ" },
            { 3: "รอบๆตัวนำ" },
            { 4: "ด้านในตัวนำ" },
          ],
          answer: "4",
        },
        {
          question: "การจำแนกคลื่นที่อาศัยตัวกลางมีกี่ประเภท อะไรบ้าง?",
          choice: [
            {
              1: "2 ประเภท คลื่นกล คลื่นตามยาว",
            },
            {
              2: "2 ประเภท คลื่นกล คลื่นเเม่เหล็กไฟฟ้า",
            },
            { 3: "2 ประเภท คลื่นตามยาว คลื่นตามขวาง" },
            {
              4: "3 ประเภท คลื่นน้ำ คลื่นเเม่เหล็กไฟฟ้า คลื่นวิทยุ",
            },
          ],
          answer: "2",
        },
        {
          question: "คลื่นใดต่อไปนี้ต้องอาศัยตัวกลางในการเคลื่อนที่?",
          choice: [
            { 1: "คลื่นวิทยุ" },
            { 2: "คลื่นไมโครเวฟ" },
            { 3: "คลื่นแสง" },
            { 4: "คลื่นเสียง" },
          ],
          Answer: "4",
        },
        {
          question:
            "คลื่นเคลื่อนที่กระทบตัวกลางใหม่แล้วมีการเคลื่อนที่กลับมายังตัวกลางเดิม เป็นสมบัติของคลื่นชนิดใด?",
          choice: [
            { 1: "การสะท้อน" },
            { 2: "การหักเห" },
            {
              3: "การเเทรกสอด",
            },
            {
              4: "การเลี้ยวเบน",
            },
          ],
          Answer: "1",
        },
        {
          question: "ข้อใดกล่าวไม่ถูกต้องเกี่ยวกับคลื่นกล",
          choice: [
            { 1: "ต้องอาศัยตัวกลางในการถ่ายโอนพลังงาน" },
            { 2: "เคลื่อนที่ผ่านสุญญากาศได้" },
            { 3: "คลื่นมีทั้งคลื่นตามยาวเเละตามขวาง" },
            { 4: "แสดงสมบัติการเลี้ยวเบนเเละการแทรกสอดได้ต์" },
          ],
          Answer: "2",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
