import { createContext } from "react";

export const NormaMath1 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "7",
      subject: "math",
      level: "2",
      totalmark: "5",
      duration: "180000",
      createBy: "Learniverse",
      content: [
        {
          question: "ผลบวกของ 3×4 และ 2×2 คือเท่าใด?",
          choice: [
            {
              1: "11",
            },
            {
              2: "12",
            },
            {
              3: "13",
            },
            {
              4: "15",
            },
          ],
          answer: "2",
        },
        {
          question: "จงหาค่าของ 2+4×3−6?",
          choice: [
            {
              1: "3",
            },
            {
              2: "4",
            },
            {
              3: "8",
            },
            {
              4: "10",
            },
          ],
          answer: "3",
        },
        {
          question:
            "ถ้าความยาวรัศมีของวงกลมคือ 7 ซม. จงหาความยาวเส้นรอบวง (ใช้ π = 22/7)?",
          choice: [
            {
              1: "22 ซม",
            },
            {
              2: "44 ซม",
            },
            {
              3: "66 ซม",
            },
            {
              4: "88 ซม",
            },
          ],
          answer: "2",
        },
        {
          question:
            "ถ้าน้ำหนักของลูกบอล 3 ลูก คือ 120 กรัม น้ำหนักเฉลี่ยของลูกบอล 1 ลูกคือเท่าใด?",
          choice: [
            {
              1: "30 กรัม",
            },
            {
              2: "40 กรัม",
            },
            {
              3: "50 กรัม",
            },
            {
              4: "60 กรัม",
            },
          ],
          answer: "2",
        },
        {
          question:
            "ถ้าสินค้าราคาปกติ 200 บาท ลดราคา 20% ราคาขายหลังลดราคาคือเท่าใด?",
          choice: [
            {
              1: "140 บาท",
            },
            {
              2: "160 บาท",
            },
            {
              3: "200 บาท",
            },
            {
              4: "220 บาท",
            },
          ],
          answer: "2",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
