import { createContext } from "react";

export const NormalBio6 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "12",
      subject: "bio",
      level: "2",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question:
            "สัตว์ที่มีกระบวนการทำให้อุณหภูมิร่างกายอุ่นขึ้นได้จากควาามร้อนที่เกิดจากการหายใจระดับเซลล์เรียกว่าอะไร?",
          choice: [
            { 1: "Poikilotherm" },
            {
              2: "Homeotherm",
            },
            {
              3: "Ectothrem",
            },
            {
              4: "Endothrem",
            },
          ],
          answer: "3",
        },
        {
          question:
            "สัตว์ที่มีอุณหภูมิร่างกายคงที่หรือเกือบคงที่เเทนที่จะขึ้นลงตามสิ่งเเวดล้อมสัตว์เหล่านั้นเรียกว่าอะไร?",
          choice: [
            { 1: "Poikilotherm" },
            { 2: "Homeotherm" },
            { 3: "Ectothrem" },
            { 4: "Endothrem" },
          ],
          answer: "2",
        },
        {
          question:
            "กระบวนการใดที่ทำหน้าที่รักษาอุณหภูมิร่างกายของสัตว์เลี้ยงลูกด้วยน้ำนมเป็นส่วนใหญ่?",
          choice: [
            { 1: "ออกซิเดชันกลูโคสหรือกรดไขมัน" },
            { 2: "สังเคราะห์คาร์โบไฮเดรตหรือโปรตีน" },
            { 3: "ย่อยไกลโคเจนหรือแป้ง" },
            { 4: "ย่อยคาร์โบไฮเดรตหรือไขมัน" },
          ],
          Answer: "1",
        },
        {
          question:
            "เมื่ออุณหภูมิร่างกายเพิ่มขึ้นเล็กน้อย วิธีการสำคัญที่ร่างกายมีการปรับตัวให้อุณหภูมิปกคิได้โดยวิธีการใด?",
          choice: [
            { 1: "หลอดเลือดบริเวณผนังหดตัว" },
            { 2: "หลอดเลือดบริเวณผิวงหนังคายตัว" },
            { 3: "หลั่งเหงื่อ" },
            { 4: "เพิ่มการเกร็งกล้ามเนื้อ" },
          ],
          Answer: "2",
        },
        {
          question: "สิ่งมีชีวิตมีเเหล่งได้ความร้อนที่สำคัญอยู่ 2 เเห่งคือ?",
          choice: [
            { 1: "ดวงอาทิตย์เเละเมเเทบอลิซึม" },
            { 2: "อาหารเเละเมเเทบอลิซึม" },
            { 3: "ดวงอาทิตย์เเละเชื้อเพลิง" },
            {
              4: "อาหารเเละน้ำ",
            },
          ],
          Answer: "1",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
