import { createContext } from "react";

export const DiffBio6 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "12",
      subject: "bio",
      level: "3",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question:
            "ขณะที่อมีบาเคลื่อนที่ โครงสร้างภายในจะมีลักษณะการทำงานเช่นเดียวกับสิ่งใด?",
          choice: [
            { 1: "ไมโครฟิลาเมนต์ของกล้ามเนื้อ" },
            {
              2: "ไมโครทูบูลของเซลล์ทั่วไป",
            },
            {
              3: "เซลล์ที่เคลื่อนไหวโดยอาศัยเเรงดันไฮโดราสเเตดิก",
            },
            {
              4: "ไมโครฟิลาเมนต์เเละไมโครทูบูล",
            },
          ],
          answer: "4",
        },
        {
          question:
            "การเคลื่อนที่ของสัตว์ส่วนมากจะอาศัยการทำงานของกล้ามเนื้อแบบแอนตาโกนีซึมยกเส้นสสัตว์ชนิดใด?",
          choice: [
            { 1: "ปลาดาว" },
            { 2: "ปลา" },
            { 3: "เเมลง" },
            { 4: "ไส้เดือนดิน" },
          ],
          answer: "3",
        },
        {
          question:
            "สัตวืพวกเเรกที่มีการทำงานของระบบกล้ามเนื้อเป็นแบบเเอนตาโกนิซึมคือ?",
          choice: [
            { 1: "พลานาเรีย" },
            { 2: "เเมงกระพรุน" },
            { 3: "ไส้เดือนดิน" },
            { 4: "ตั๊กเเตน" },
          ],
          Answer: "3",
        },
        {
          question: "สัตวืกลุ่มที่อาศัยระบบน้ำช่วยในการเคลื่อนที่ ได้เเก่?",
          choice: [
            { 1: "พารามีเซียม ไฮดรา หวีวุ้น" },
            { 2: "ยูกลีนา ฟองน้ำ พลานาเรีย" },
            { 3: "เเมงกระพรุน ปลาดาว หอยสองฝา" },
            { 4: "ปลาหมึก ปลาฉลาม ปลาดาว" },
          ],
          Answer: "3",
        },
        {
          question:
            "ในระหว่างการวิ่งของสุนัข สุนัขเคลื่อนที่ไปได้โดยอาศัยการทำงานของระบบอวัยวะอะไรบ้าง?",
          choice: [
            { 1: "ระบบกล้ามเนื้อเรียบ" },
            { 2: "ระบบกล้ามเนื้อลาย" },
            { 3: "ระบบกล้ามเนื้อที่ยึดกับกระดูก" },
            { 4: "ระบบกล้ามเนื้อที่อยู่นอกการควบคุมของจิตใจ" },
          ],
          Answer: "3",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
