import { createContext } from "react";

export const DiffChem6 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "12",
      subject: "chem",
      level: "3",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "สารประกอบอินทรีย์หมายถึงข้อใด?",
          choice: [
            { 1: "สารที่ได้มาจากสิ่งมีชีวิต" },
            { 2: "สารที่ประกอบด้วย Cได้มาจากสิ่งมีชีวิตและการสังเคราะห์" },
            { 3: "สารที่ประกอบด้วย C" },
            { 4: "สารที่ประกอบด้วย C และO เป็นหลัก" },
          ],
          answer: "2",
        },
        {
          question: "ต่อไปนี้ถูกต้องเกี่ยวกับธาตุคาร์บอน ยกเว้นข้อใด?",
          choice: [
            { 1: "เป็นอโลหะมีสถานะเป็นของแข็ง" },
            { 2: "ไม่นำไฟฟ้า ยกเว้นแกรไฟต์" },
            { 3: "อยู่หมู่ 4 มีเวเลนซ์อิเล็กตรอน 4" },
            {
              4: "เกิดพันธะกับออกซิเจนได้ 3 พันธะ",
            },
          ],
          answer: "4",
        },
        {
          question: "ไอโซเมอริซึม (Isomerism) หมายถึงอะไร?",
          choice: [
            { 1: "สารที่มีสูตรโครงสร้างแบบเส้นตรงและโซ่กิ่งได้" },
            { 2: "สารที่มีสมบัติทุกอย่างเหมือนกันแต่สูตรโมเลกุลต่างกัน" },
            { 3: "สารที่มีสูตรโมเลกุลเหมือนกันแต่สูตรโครงสร้างต่างกัน" },
            { 4: "สารที่มีสูตรโมเลกุลต่างกันแต่สูตรโครงสร้างเหมือนกัน" },
          ],
          Answer: "3",
        },
        {
          question:
            "Alkane ทีมีสูตรโมเลกุล C6H14 เกิด Isomer ได้ทั้งหมดกี่ Isomer?",
          choice: [
            { 1: "2" },
            { 2: "3" },
            {
              3: "4",
            },
            {
              4: "5",
            },
          ],
          Answer: "3",
        },
        {
          question:
            "โมเลกุลของ Aromatic Hydrocarbon ที่เสียอะตอมของ Hydrogan ตั้งแต่ 1 อะตอมขึ้นไปเรียกว่าอะไร",
          choice: [
            { 1: "Hydroxyl Group" },
            { 2: "Methyl Group" },
            { 3: "Aryl Group" },
            { 4: "Carboxyl Group" },
          ],
          Answer: "3",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
