import { createContext } from "react";

export const DiffChem6 = [
  [
    {
      label: "test1",
      grade: "12",
      subject: "chem",
      level: "3",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "ความเร่ง คือ?",
          choice: [
            { 1: "ระยะทางหารด้วยเวลา" },
            { 2: "ความเร็วหารด้วยเวลา" },
            { 3: "เวลาหารด้วยระยะทาง" },
            { 4: "ผิดทุกข้อ" },
          ],
          answer: "2",
        },
        {
          question:
            "เครื่องบินบินได้ระยะทาง 500 กม ในเวลา 5 นาที จะมีความเร็วเฉล่ี่ยเท่าใด (กิโลเมตรต่อนาที)?",
          choice: [
            { 1: "25" },
            { 2: "50" },
            { 3: "75" },
            {
              4: "100",
            },
          ],
          answer: "4",
        },
        {
          question:
            "รถยนต์คันหนึ่งวิ่งด้วยอัตราเร็วคงที่ 20 เมตรต่อวินาที นานเท่าใดจึงจะเคลื่อนที่ได้ระยะทาง 500 เมตร?",
          choice: [
            { 1: "10 วินาที" },
            { 2: "15 วินาที" },
            { 3: "20 วินาที" },
            { 4: "20 วินาที" },
          ],
          Answer: "4",
        },
        {
          question:
            "รถวิ่งจากจุด A ไปตามทางโค้งจนถึงจุด B วัดระยะทางการเคลื่อนที่ได้ 8 กิโลเมตร เป็นปริมาณประเภทใด?",
          choice: [
            { 1: "ปริมาณสเกลาร์" },
            { 2: "ปริมาณเวกเตอร์" },
            {
              3: "ปริมาณเชิงบวก",
            },
            {
              4: "ปริมาณเชิงลบ",
            },
          ],
          Answer: "1",
        },
        {
          question: "ข้อใดเป็นกล่าวได้ถูกต้องเกี่ยวกับการกระจัด",
          choice: [
            { 1: "การกระจัดเป็นปริมาณสเกลาร์Hydroxyl Group" },
            { 2: "การกระจัดคือมีค่ามากกว่าระยะทางเสมอ" },
            { 3: "การกระจัดคือระยะทางทั้งหมดที่วัตถุเคลื่อนที่" },
            { 4: "การกระจัดคือระยะห่างจากจุดเริ่มต้นจนถึงจุดสุดท้าย" },
          ],
          Answer: "4",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
