import { createContext } from "react";

export const NormalChem6 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "12",
      subject: "chem",
      level: "2",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question:
            "แอลคีนที่โมเลกุลเป็นของแข็งจะมีคาร์บอนตั้งแต่กี่อะตอมขึ้นไป?",
          choice: [
            { 1: "4 อะตอม" },
            { 2: "10 อะตอม" },
            { 3: "15 อะตอม" },
            { 4: "19 อะตอม" },
          ],
          answer: "4",
        },
        {
          question: "สูตรโมเลกุลของเฮกซีนกับเพนเทน มีจำนวนไฮโดรเจนเป็นอย่างไร?",
          choice: [
            {
              1: "เฮกซีนมากกว่าเพนเทน 2 อะตอม",
            },
            {
              2: "เพนเทนมีมากกว่าเฮกซีน 2 อะตอม",
            },
            { 3: "เฮกซีนมากกว่าเพนเทน 1 อะตอม" },
            {
              4: "เท่ากัน",
            },
          ],
          answer: "4",
        },
        {
          question:
            "นักวิทยาศาสตร์ที่ถือว่าเป็นบิดาแห่งวิชาเคมีอินทรีย์ ที่เตรียมยูเรียซึ่งเป็นสารอินทรีย์ได้จากสารอนินทรีย์ คือใคร?",
          choice: [
            { 1: "อาโวกาโดร" },
            { 2: "โรเบริต บอยล์" },
            { 3: "ฟรีดริค วูห์เลอร์" },
            { 4: "บรอนสเตดและลาวรี" },
          ],
          Answer: "3",
        },
        {
          question:
            "ข้อใดไม่ใช่เหตุผลที่คาร์บอนสามารถเกิดสารประกอบได้จำนวนมาก?",
          choice: [
            {
              1: "C อะตอมสามารถเกิดพันธะโคเวเลนต์ได้ทั้งพันธะเดี่ยว พันธะคู่ และพันธะสาม",
            },
            {
              2: "C สามารถเกิดพันธะโควาเลนต์กับธาตุ C ด้วยกันได้โดยอาจเกิดเป็นโซ่ยาว โซ่กิ่ง เป็นวงหรือวงแหวน",
            },
            {
              3: "ธาตุ C สามารถสร้างพันธะกับธาตุอื่นๆ ได้จำนวนมากเช่น สร้างพันธะกับ H, O, N, S เป็นต้น",
            },
            {
              4: "การมีสูตรโครงสร้างที่ต่างกัน จากสูตรโมเลกุลที่ต่างกัน",
            },
          ],
          Answer: "4",
        },
        {
          question: "สารที่มีไอโซเมอริซึม หมายถึงสารในข้อใด",
          choice: [
            { 1: "สารที่มีจำนวนคาร์บอนอะตอมเท่ากัน" },
            { 2: "สารที่เกิดเป็นโมเลกุลใหญ่รวมตัวของโมเลกุลเล็ก" },
            { 3: "สารที่มีสูตรโมเลกุลเหมือนกันแต่โครงสร้างต่างกัน" },
            { 4: "สารที่มีโมเลกุลใหญ่ ซึ่งแตกตัวเป็นโมเลกุลเล็กๆ ได้" },
          ],
          Answer: "3",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
