import { createContext } from "react";

export const DiffMath3 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "12",
      subject: "math",
      level: "3",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question:
            "นักเรียนชั้น ม.6 ทั่วประเทศมีคะเเนนเฉลี่ย GPA เท่ากับ 2,499 ค่าเบี่ยงเบนมาตรฐานเท่ากับ 0.88 ถ้านายกบได้คะเเนน GPA เท่ากับ 2.89 เเล้วค่ามาตรฐานของคะเเนน GPA ของนายกบจะเท่าไร?",
          choice: [
            { 1: "-0.44" },
            { 2: "0.44" },
            { 3: "0.38" },
            { 4: "-0.38" },
          ],
          answer: "2",
        },
        {
          question:
            "สมมติว่าคะเเนนมาตรฐานของการสอบกลางภาควิชาคณิตศาสตร์ของนักเรียนชั้น ม.6 เท่ากับ 1.10 เเละมีคะเเนนเฉลี่ยเท่ากับ 11.29 ถ้า น.ส.เตย สอบได้ 18 คะเเนน จงหาค่าความแปรปรวนของการสอบครั้งนี้",
          choice: [
            { 1: "1.06" },
            { 2: "6.10" },
            { 3: "37.21" },
            { 4: "40.45" },
          ],
          answer: "3",
        },
        {
          question:
            "ถ้าความสัมพันธ์เชิงฟังก์ชันคือ Y = 0.4X + 1.8 เเล้วข้อใดผิด?",
          choice: [
            { 1: "ถ้า X = 2.50 เเล้วสามารถทำนายค่า Y = 2.80" },
            { 2: "ถ้า X = 1.40 เเล้วทำนายค่า Y = 2.36" },
            { 3: "ถ้า Y = 10 เเล้วทำนายค่า X = 20.50" },
            { 4: "กราฟของความสัมพันธืนี้ตัดเเกน Y ที่จุด (0,1.80)" },
          ],
          Answer: "3",
        },
        {
          question: "กำหนดให้ f(x) = -1.25x+5 ถ้า Y = 40 เเล้ว X จะมีค่าเท่ใด?",
          choice: [
            { 1: "-45" },
            { 2: "43.75" },
            { 3: "-43.75" },
            { 4: "คำตอบเป็นอย่างอื่น" },
          ],
          Answer: "4",
        },
        {
          question: "เเบคทีเรียชนิดหนึ่งจะเพิ่มขึ้นเท่าตัวทุกๆ 1 ชั่วโมง ถ้าเริ่มต้นมีเเบคทีเรียจำนวน 2 เซลล์ เมื่อครบ 9 ชั่วโมงจะมีเเบคทีเรียจำนวนกี่เซลล์",
          choice: [{ 1: "18 เซลล์" }, { 2: "72 เซลล์" }, { 3: "128 เซลล์" }, { 4: "1,024 เซลล์" }],
          Answer: "4",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
