import { createContext } from "react";

export const NormalMath6 = [
  [
    {
      label: "test1",
      grade: "12",
      subject: "math",
      level: "2",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "จงหาเลขถัดไปจากลำดับต่อไปนี้ 300, 150, 100, 75?",
          choice: [{ 1: "20" }, { 2: "40" }, { 3: "60" }, { 4: "80" }],
          answer: "3",
        },
        {
          question:
            "จงหาอัตราส่วนของพื้นที่ผิวต่อปริมาตรของกระบอกตัน กำหนดให้รัศมีของทรงกระบอกเป็น 20 หน่วย เเละความยาวของทรงกระบอกเป็น 100 หน่วย",
          choice: [
            { 1: "0.6 หน่วย" },
            { 2: "0.10 หน่วย" },
            { 3: "0.12 หน่วย" },
            { 4: "0.18 หน่วย" },
          ],
          answer: "3",
        },
        {
          question:
            "รถยนต์คันหนึ่งวิ่งด้วยความเร็วเฉลี่ย 60 กิโลเมตรต่อชั่วโมง จงหาว่ารถยนต์คันนี้ใช้เวลาเดินทางกี่ชั่วโมงถ้าต้องเดินทางไป 300 กิโลเมตร?",
          choice: [
            { 1: "3 ชั่วโมง" },
            { 2: "4 ชั่วโมง" },
            { 3: "5 ชั่วโมง" },
            { 4: "6 ชั่วโมง" },
          ],
          Answer: "3",
        },
        {
          question:
            "นักเรียนกลุ่มหนึ่งมี 9 คน พบว่ามีอายุเฉลี่ย 15 ปี ส่วนเบี่ยงเบนมาตรฐานของอายุ 2 ปี ถ้าเพิ่มนักศึกษาอายุ 25 ปีอีก 1 คน จะมีส่วนเบี่บงเบนมาตรฐานของอายุเป็นเท่าไร?",
          choice: [{ 1: "2" }, { 2: "2.2" }, { 3: "2.5" }, { 4: "2.8" }],
          Answer: "4",
        },
        {
          question:
            "ในการสัมภาษณ์นักเรียน 3 คน พบว่ามีค่าเฉลี่ยเลขคณิตเป็น 53 คะเเนน มัธยฐานเป็น 50 คะเเนน พิสัยเป็น 21 คะเเนน ความแปรปรวนของคะเเนนนการสอบสัมภาษณ์ครั้งนี้เป็นเท่าไร?",
          choice: [{ 1: "76" }, { 2: "77" }, { 3: "78" }, { 4: "79" }],
          Answer: "3",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
