import { createContext } from "react";

export const EasyPhy6 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "12",
      subject: "phy",
      level: "1",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question:
            "คลื่นกลตามยาวและคลื่นกลตามขวางถูกนิยามขึ้นโดยดูจากปัจจัยใดเป็นหลัก?",
          choice: [
            { 1: "ทิศการเคลื่อนที่ของคลื่น" },
            { 2: "ทิศการสั่นของอนุภาคตัวกลาง" },
            { 3: "ระเภทของแหล่งกำเนิด" },
            { 4: "ความยาวคลื่น" },
          ],
          answer: "2",
        },
        {
          question: "ปัจจัยใดต่อไปนี้มีผลต่ออัตราเร็วเสียงในอากาศ?",
          choice: [
            {
              1: "ความถี่",
            },
            {
              2: "อุณหภูมิ",
            },
            { 3: "ความดัง" },
            {
              4: "ความเข้มเสียง",
            },
          ],
          answer: "2",
        },
        {
          question: "เหตุใดที่คลื่นแม่เหล็กไฟฟ้าจึงจัดเป็นคลื่นตามขวาง?",
          choice: [
            { 1: "เพราะสนามแม่เหล็กมีทิศตั้งฉากกับสนามไฟฟ้า" },
            {
              2: "เพราะสนามแม่เหล็กและสนามไฟฟ้ามีทิศตรงข้ามกับทิศทางเคลื่อนที่ของคลื่น",
            },
            {
              3: "เพราะสนามแม่เหล็กและสนามไฟฟ้ามีทิศตั้งฉากกับทิศการเคลื่อนที่ของคลื่น",
            },
            {
              4: "เพราะสนามแม่เหล็กและสนามไฟฟ้ามีทิศเดียวกับทิศการเคลื่อนที่ของคลื่น",
            },
          ],
          Answer: "3",
        },
        {
          question:
            "ถ้าสถานีวิทยุเอเอ็มแห่งหนึ่งกระจายเสียงที่ความถี่ 800 kHz ข้อใดกล่าวถูกต้อง?",
          choice: [
            {
              1: "เสียงพูดถูกนำไปเพิ่มแอมพลิจูดและส่งออกไปโดยมีสัญญาณความถี่ 800 kHz คั่นเป็นระยะ ๆ",
            },
            { 2: "เสียงพูดถูกนำไปผสมกับคลื่นพาหะที่มีความถี่ 800 kHz" },
            {
              3: "เสียงพูดถูกนำไปผสมกับความคลื่นพาหะที่มีความถี่ไม่คงที่ แต่ให้ผลลัพธ์ที่มีความถี่ 800 kHz",
            },
            {
              4: "คลื่นพาะความถี่ 800 kHz ถูกปรับความถี่ลงให้เหลือไม่เกิน 20 kHz เพื่อให้หูมนุษย์รับฟังได้",
            },
          ],
          Answer: "2",
        },
        {
          question:
            "ชื่อสามัญของของสารต่อไปนี CH3 - CH2 - CH = CH2 คือข้อใดข้อใดเป็นสมบัติของรังสีแอลฟา?",
          choice: [
            { 1: "เป็นอิเล็กตรอน" },
            { 2: "เป็นคลื่นแม่เหล็กไฟฟ้า" },
            { 3: "เป็นนิวเคลียสของอะตอมฮีเลียม" },
            { 4: "เป็นโปรตอน" },
          ],
          Answer: "3",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
