import { createContext } from "react";

export const NormalBio4 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "10",
      subject: "bio",
      level: "2",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "ประโยชน์ของเม็ดเลือดแดงคืออะไร?",
          choice: [
            { 1: "การขนส่งออกซิเจน" },
            { 2: "การก่อสร้างกระดูก" },
            { 3: "การควบคุมการออกซิเจน" },
            { 4: "การทำลายเชื้อโรค" },
          ],
          answer: "1",
        },
        {
          question:
            " อะไรคือหลักการหลีกเลี่ยงที่เสี่ยงต่อการแพร่ระบาดของโรคติดเชื้อ??",
          choice: [
            { 1: "การสวมหน้ากาก" },
            { 2: "การล้างมือ" },
            { 3: "การเว้นระยะห่างทางสังคม" },
            { 4: "การออกกำลังกายที่แข็งแรง" },
          ],
          answer: "3",
        },
        {
          question:
            "ส่วนใดของเซลล์คือที่รับรู้สารเคมีและส่งคำสั่งไปยังส่วนอื่นของเซลล์?",
          choice: [
            { 1: "รีบโรมัต" },
            { 2: "สมอง" },
            { 3: "ชิ้นส่วนของเมมบราน" },
            { 4: "ส่วนเซลล์บริเวณผนังเซลล์" },
          ],
          Answer: "2",
        },
        {
          question:
            "กระบวนการใดเป็นกระบวนการที่ใช้พลังงานและก๊าซคาร์บอนไดออกไซด์ในการสร้างอนุภาคอินทรีย์และออกซิเจน?",
          choice: [
            { 1: "การสะสม" },
            { 2: "การสังเคราะห์" },
            { 3: "การแทรกแทรง" },
            { 4: "การหายใจ" },
          ],
          Answer: "2",
        },
        {
          question: "อะไรเป็นโครงสร้างหลักของเซลล์พืช?",
          choice: [
            { 1: "จุดเชื่อมต่อ" },
            { 2: "ส่วนกลาง" },
            { 3: "กล้ามเนื้อ" },
            { 4: "เซลล์เยื่อบุผนัง" },
          ],
          Answer: "4",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
