import { createContext } from "react";

export const EasyBio4 = [
  [
    {
      label: "test1",
      grade: "10",
      subject: "bio",
      level: "1",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question:
            "สัตว์บกชนิดหนึ่งมีโครงสร้างเเข็งภายนอกลำตัว เทรเคีย เเละลำตัวเป็นปล้อง น่าจะมีโครงสร้างในข้อใด?",
          choice: [
            { 1: "ปีก" },
            { 2: "ขา 8 ขา" },
            { 3: "เนฟริเดียม" },
            { 4: "รยางค์ไม่เป็นปล้อง" },
          ],
          answer: "2",
        },
        {
          question:
            " อะไรคือหลักการหลีกเลี่ยงที่เสี่ยงต่อการแพร่ระบาดของโรคติดเชื้อ??",
          choice: [
            { 1: "การสวมหน้ากาก" },
            { 2: "การล้างมือ" },
            { 3: "การเว้นระยะห่างทางสังคม" },
            { 4: "การออกกำลังกายที่แข็งแรง" },
          ],
          answer: "3",
        },
        {
          question:
            "ส่วนใดของเซลล์คือที่รับรู้สารเคมีและส่งคำสั่งไปยังส่วนอื่นของเซลล์?",
          choice: [
            { 1: "รีบโรมัต" },
            { 2: "สมอง" },
            { 3: "ชิ้นส่วนของเมมบราน" },
            { 4: "ส่วนเซลล์บริเวณผนังเซลล์" },
          ],
          Answer: "2",
        },
        {
          question:
            "กระบวนการใดเป็นกระบวนการที่ใช้พลังงานและก๊าซคาร์บอนไดออกไซด์ในการสร้างอนุภาคอินทรีย์และออกซิเจน?",
          choice: [
            { 1: "การสะสม" },
            { 2: "การสังเคราะห์" },
            { 3: "การแทรกแทรง" },
            { 4: "การหายใจ" },
          ],
          Answer: "2",
        },
        {
          question: "อะไรเป็นโครงสร้างหลักของเซลล์พืช?",
          choice: [
            { 1: "จุดเชื่อมต่อ" },
            { 2: "ส่วนกลาง" },
            { 3: "กล้ามเนื้อ" },
            { 4: "เซลล์เยื่อบุผนัง" },
          ],
          Answer: "4",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
