import { createContext } from "react";

export const DiffChem4 = [
  [
    {
      label: "test1",
      grade: "10",
      subject: "chem",
      level: "3",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "สารในข้อใดมีสมบัติความเป็นกรด-เบสเหมือนกัน?",
          choice: [
            { 1: "ผงฟู ผงซักฟอก เกลือเเกง" },
            { 2: "เบียร์ น้ำปูนใส น้ำตาลทราย" },
            { 3: "น้ำยาเช็ดกระจก ผงชูรส ยาสระผม" },
            { 4: "น้ำมะขาม น้ำมะเขือเทศ น้ำส้มสายชู" },
          ],
          answer: "4",
        },
        {
          question:
            "เมื่อหยดน้ำลงบนเเคลเซียมคาร์ไบด์จะได้สารใหม่ที่เกิดขึ้นเป็นก๊าซที่มีกลิ่นเเละติดไฟ เป็นการเกิดปฏิกิริยาตามข้อใด?",
          choice: [
            { 1: "ปฏิกิริยาดูดความร้อน" },
            { 2: "ปฏิกิริยาคายความร้อน" },
            { 3: "ปฏิกิริยาทางกายภาพ" },
            { 4: "ปฏิกิริยาความร้อนแฝง" },
          ],
          answer: "2",
        },
        {
          question: "ข้อใดทำให้เกิดการเปลี่ยนแปลงทางเคมี?",
          choice: [
            { 1: "การเเยกน้ำด้วยไฟฟ้า" },
            { 2: "การทาสีประตูเหล็ก" },
            { 3: "การชุปโลหะด้วยทองคำ" },
            { 4: "การชุปโลหะด้วยโครเมียม" },
          ],
          Answer: "1",
        },
        {
          question: "ข้อใดไม่ใช่สมบัติของรัสีจากธาตุกัมมันตรังสี?",
          choice: [
            { 1: "ทำให้เเก๊สเเตกตัวนำไฟฟ้าได้" },
            { 2: "ทุกชนิดเบี่ยงเบนในสนามไฟฟ้า" },
            { 3: "บางชนิดมีอำนาจทะลุทะลวงสูงมาก" },
            { 4: "ทำให้เกิดธาตุกัมมันตรังสีชนิดใหม่ได้" },
          ],
          Answer: "2",
        },
        {
          question: "ข้อใดจัดเป็นสารประกอบทั้งหมด",
          choice: [
            { 1: "เเยม กรดน้ำส้ม ยูเรีย" },
            { 2: "ด่างทับทิม น้ำเชื่อม จุนสี" },
            { 3: "น้ำมัน น้ำมันดิบ เเนพทาลีน" },
            { 4: "โซดาแอช กรดแอสคอร์บิก สารส้ม" },
          ],
          Answer: "4",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
