import { createContext } from "react";

export const NormalChem4 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "10",
      subject: "chem",
      level: "2",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "ข้อใดถูกต้องที่สุด?",
          choice: [
            { 1: "สารประกอบคาร์บอเนตไม่ทำปฏิกิริยากับกรด" },
            { 2: "สารประกอบคาร์บอเนตเมื่อทำปฏิกิริยากับกรดจะให้เเก๊สออกซิเจน" },
            {
              3: "สารประกอบคาร์บอเนตเมื่อทำปฏิกิริยากับกรดจะให้เเก๊สคาร์บอนไดออกไซด์",
            },
            {
              4: "สารประกอบคาร์บอเนตเมื่อทำปฏิกิริยากับกรดจะให้เเก๊สไฮดรอกไซด์",
            },
          ],
          answer: "3",
        },
        {
          question:
            "ในการจำเเนกประเภทของสารเป็ร สารละลาย คอลลอยด์ เเละสารเเขวนลอย ควรพิจารณาโดยใช้เกณฑ์ในข้อใด?",
          choice: [
            { 1: "สี" },
            { 2: "ความขุ่น" },
            { 3: "ขนาดอนุภาค" },
            { 4: "องค์ประกอบ" },
          ],
          answer: "3",
        },
        {
          question:
            "นำของเหลวชนิดหนึ่งไประเหยเเห้งพบว่าไม่มีสารใดเหลืออยู่ภายในภาชนะเลย การสรุปที่ดีที่สุดเกี่ยวกับของเหลวชนิดนี้คือข้อใด?",
          choice: [
            { 1: "เป็นสารละลาย" },
            { 2: "เป็นสารบริสุทธิ์" },
            { 3: "เป็นตัวทำละลาย" },
            { 4: "ไม่มีของเเข็งเป็นองค์ประกอบ" },
          ],
          Answer: "4",
        },
        {
          question:
            "ในการวิเคราะห์องค์ประกอบของสีจากสิ่งต่างๆ ด้วยวิธีโครมาโตกราฟี ข้อใดไม่เหมาะกับหลักการวิเคราะห์โดยใช้วิธีนี้?",
          choice: [
            { 1: "องค์ประกอบของสีในใบไม้" },
            { 2: "องค์ประกอบของสีในน้ำส้มสายชูกลั่น" },
            { 3: "องคืประกอบของสีในปากกาเมจิก" },
            { 4: "องค์ประกอบของสีที่ใช้ย้อมผ้าสีดำ" },
          ],
          Answer: "2",
        },
        {
          question: "ธาตุที่ค้นพบทั้งหมดแบ่งออกเป็นกี่พวก อะไรบ้าง",
          choice: [
            { 1: "2 พวก คือโลหะเเละอโลหะ" },
            { 2: "2 พวก คือ ธาตุที่เกิดเองเเละธาตุสังเคราะห์" },
            { 3: "3 พวก คือ โลหะ อโลหะเเละไม่ใช่ทั้งโลหะเเละอโลหะ" },
            { 4: "3 พวก คือ ของเเข็ง ของเหลว เเก๊ส" },
          ],
          Answer: "3",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
