import { createContext } from "react";

export const DiffMath4 = [
  [
    {
      label: "test1",
      grade: "10",
      subject: "math",
      level: "3",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question:
            "ถ้า x เเละ y เป็นจำนวนเต็มบวกที่ทำให้ 2x+4y = 25 เเละ y = x+2 ค่าของ x เเละ y คือเท่าใด?",
          choice: [
            { 1: "x=3,y=5" },
            { 2: "x=5,y=3" },
            { 3: "x=2,y=7" },
            { 4: "x=7,y=2" },
          ],
          answer: "1",
        },
        {
          question:
            "พื้นที่ของรูปสามเหลี่ยมที่มีฐาน 8 ซม. และสูง 6 ซม. มีค่าเท่าใด?",
          choice: [
            { 1: "24 ตร.ซม." },
            { 2: "36 ตร.ซม" },
            { 3: "48 ตร.ซม." },
            { 4: "96 ตร.ซม." },
          ],
          answer: "1",
        },
        {
          question:
            "ถ้าผลบวกของจำนวนเต็มบวกสองจำนวนที่ต่างกัน 1 คือ 25 จงหาจำนวนทั้งสอง?",
          choice: [
            { 1: "12 และ 13" },
            { 2: "11 และ 14" },
            { 3: "10 และ 15" },
            { 4: "10 และ 15" },
          ],
          Answer: "1",
        },
        {
          question:
            "จงหาผลเฉลี่ยนเลขคณิตศาสตร์ของชุดข้อมูล 5, 10, 15, 20, 25 ?",
          choice: [{ 1: "10" }, { 2: "12.5" }, { 3: "15" }, { 4: "17.5" }],
          Answer: "3",
        },
        {
          question: "ให้ f(x) = 3x+4 เเละ g(x) = 2x-1 จงหา (fog)(x) ",
          choice: [{ 1: "6x+3" }, { 2: "6x+2" }, { 3: "6x+1" }, { 4: "6x-1" }],
          Answer: "3",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
