import { createContext } from "react";

export const EasyPhy4 = [
  [
    {
      label: "test1",
      grade: "10",
      subject: "phy",
      level: "1",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "ข้อใดกล่าวได้ถูกต้อง?",
          choice: [
            { 1: "อัตราเร็วคือการกระจัด/เวลา" },
            { 2: "ความเร็วมีค่าเป็นปริมาณสเกลาร์" },
            { 3: "ปริมาณเวกเตอร์จะมีค่ามากกว่าปริมาณสเกลาร์" },
            { 4: "ความเร่งคืออัตราการเปลี่ยนแปลงความเร็วในหนึ่งหน่วย" },
          ],
          answer: "4",
        },
        {
          question:
            "นครศรีธรรมราชอยู่ห่างจากกรุงเทพฯ 733 กิโลเมตร เครื่องบินบินจากนครศรีธรรมราชไปกรุงเทพฯ ด้วยอัตราเร็ว 850 กิโลเมตรต่อชั่วโมง เครื่องบินใช้เวลาบินกี่ชั่วโมง?",
          choice: [
            { 1: "0.86 ชั่วโมง" },
            { 2: "0.87 ชั่วโมง" },
            { 3: "0.90 ชั่วโมง" },
            { 4: "0.97 ชั่วโมง" },
          ],
          answer: "1",
        },
        {
          question:
            "วัตถุหนึ่งเคลื่อนที่เป็นวงกลมรัศมี 21 เมตร ครบหนึ่งรอบ การกระจัดเป็นเท่าใด?",
          choice: [{ 1: "0" }, { 2: "42" }, { 3: "84" }, { 4: "132" }],
          Answer: "1",
        },
        {
          question:
            "การเคลื่อนที่ของข้อใดต่อไปนี้ที่ความเร่งของวัตถุเป็นศูนย์?",
          choice: [
            { 1: "การเคลื่อนที่แบบวงกลมด้วยอัตรารเ็วคงตัว" },
            { 2: "การตกลงตรงๆในแนวดิ่งโดยไม่มีแรงต้านอากาศ" },
            { 3: "การเคลื่อนที่เป็นเส้นตรงในแนวระดับด้วยอัตราเร็วคงตัว" },
            { 4: "การไถลลงเป็นเส้นตรงบนพื้นเอียงที่ไม่มีแรงเสียดทาน" },
          ],
          Answer: "3",
        },
        {
          question: "ระยะทางในระบบ SI มีหน่วยเป็นอะไร",
          choice: [
            { 1: "เมตร" },
            { 2: "ไมค์" },
            { 3: "เซนติเมตร" },
            { 4: "ฟุต" },
          ],
          Answer: "1",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
