import { createContext } from "react";

export const NormalPhy4 = [
  [
    {
      _id: {
        $oid: "6661783a6ad4d74a56f03de7",
      },
      label: "test1",
      grade: "10",
      subject: "phy",
      level: "2",
      totalmark: "5",
      duration: "180000",
      content: [
        {
          question: "ข้อแตกต่างของระยะทางกับการกระจัด คือ ข้อใด?",
          choice: [
            { 1: "ระยะทาง และการกระจัดเป็นปริมาณสเกลาร์" },
            { 2: "ระยะทาง และการกระจัดเป็นปริมาณเวกเตอร์" },
            {
              3: "ระยะทางเป็นปริมาณสเกลาร์ การกระจัดเป็นปริมาณเวกเตอร์",
            },
            {
              4: "ระยะทางเป็นปริมาณเวกเตอร์ การกระจัดเป็นปริมาณสเกลาร์",
            },
          ],
          answer: "3",
        },
        {
          question: "ข้อใดคือปริมาณเวกเตอร์?",
          choice: [
            { 1: "ระยะทาง , เวลา" },
            { 2: "ความเร่ง , มวล" },
            { 3: "ความเร็ว , การกระจัด" },
            { 4: "น้ำหนัก , มวล" },
          ],
          answer: "3",
        },
        {
          question:
            "วัตถุหนึ่งเคลื่อนที่ได้ครึ่งรูปวงกลม ที่เส้นผ่านศูนย์กลาง 10 เมตร จงหาระยะทาง?",
          choice: [
            { 1: "10 เมตร" },
            { 2: "15.7 เมตร" },
            { 3: "20 เมตร" },
            { 4: "25.6 เมตร" },
          ],
          Answer: "2",
        },
        {
          question: "เหตุการณ์ต่อไปนี้ข้อใดเป็นการเคลื่อนที่ในแนวตรง?",
          choice: [
            { 1: "รถเลี้ยวโค้ง" },
            { 2: "การตีแบตมินตัน" },
            { 3: "มะม่วงหล่นจากต้น" },
            { 4: "การชูตลูกบาสเกตบอล" },
          ],
          Answer: "3",
        },
        {
          question: "ข้อใดต่อไปนี้ไม่ใช่ปริมาณเวกเตอร์",
          choice: [
            { 1: "ความเร็ว" },
            { 2: "ความเร่ง" },
            { 3: "แรงโน้มถ่วงของโลก" },
            { 4: "ปริมาตร" },
          ],
          Answer: "4",
        },
      ],
    },
  ],
];

export const AuthContext = createContext(null);
